In [2]:
import pandas as pd
# Dictionary of key pair values called data
data = {'Name':['Ashika', 'Tanu', 'Ashwin', 'Mohit', 'Sourabh'],
        'Age': [24, 23, 22, 19, 10]}
data

{'Name': ['Ashika', 'Tanu', 'Ashwin', 'Mohit', 'Sourabh'],
 'Age': [24, 23, 22, 19, 10]}

In [3]:
df = pd.DataFrame(data)
df

      Name  Age
0   Ashika   24
1     Tanu   23
2   Ashwin   22
3    Mohit   19
4  Sourabh   10

Performing operations on Rows and Columns.

In [4]:
# Selecting column
df[['Name']]

      Name
0   Ashika
1     Tanu
2   Ashwin
3    Mohit
4  Sourabh

In [5]:
# Selecting a row
row = df.loc[1]
row

Name    Tanu
Age       23
Name: 1, dtype: object

In [2]:
# Creating a Series from Dictionary
# import pandas
import pandas as pd

# a simple dictionary
dict = {'Geeks': 10,
'for': 20,
'geeks': 30}

# create series from dictionary
print(pd.Series(dict))

Geeks    10
for      20
geeks    30
dtype: int64

In [17]:
import pandas as pd

data = {
    'region': ['North', 'North', 'South', 'South','South', 'East', 'East', 'North'],
    'subdivision': ['A', 'B', 'A', 'B','B', 'A', 'B', 'A'],
    'player_name': ['Alice', 'Bob', 'Alice', 'Dave','Dave', 'Eve', 'Frank', 'Alice'],
    'salary': [5000, 6000, 7000, 8000,8000, 9000, 10000, 2000]
}

df = pd.DataFrame(data)
df

  region subdivision player_name  salary
0  North           A       Alice    5000
1  North           B         Bob    6000
2  South           A       Alice    7000
3  South           B        Dave    8000
4  South           B        Dave    8000
5   East           A         Eve    9000
6   East           B       Frank   10000
7  North           A       Alice    2000

In [18]:
player_counts = df.groupby(['region', 'subdivision']).size().reset_index(name='player_count')
print(player_counts)

  region subdivision  player_count
0   East           A             1
1   East           B             1
2  North           A             2
3  North           B             1
4  South           A             1
5  South           B             2

In [19]:
df.groupby(['region', 'subdivision']).size()

region  subdivision
East    A              1
        B              1
North   A              2
        B              1
South   A              1
        B              2
dtype: int64

In [20]:
df.groupby(['region', 'subdivision']).count()

                    player_name  salary
region subdivision
East   A                      1       1
       B                      1       1
North  A                      2       2
       B                      1       1
South  A                      1       1
       B                      2       2

In [22]:
df.groupby(['region', 'subdivision', 'player_name'])['salary'].sum().reset_index()

  region subdivision player_name  salary
0   East           A         Eve    9000
1   East           B       Frank   10000
2  North           A       Alice    7000
3  North           B         Bob    6000
4  South           A       Alice    7000
5  South           B        Dave   16000

In [27]:
# how many times each player appears in the data:

df.groupby(['region', 'subdivision', 'player_name']).size().reset_index(name='count')

# df.groupby(['region', 'subdivision', 'player_name']).agg(total_salary=('salary', 'sum'),appearances=('player_name', 'count')).reset_index()

  region subdivision player_name  count
0   East           A         Eve      1
1   East           B       Frank      1
2  North           A       Alice      2
3  North           B         Bob      1
4  South           A       Alice      1
5  South           B        Dave      2

In [30]:
df.groupby(['region', 'subdivision'])['player_name'].nunique().reset_index(name='unique_players')

  region subdivision  unique_players
0   East           A               1
1   East           B               1
2  North           A               1
3  North           B               1
4  South           A               1
5  South           B               1

In [26]:
df.groupby(['region', 'subdivision', 'player_name']).agg(
    total_salary=('salary', 'sum'),
    appearances=('player_name', 'count'))

                                total_salary  appearances
region subdivision player_name
East   A           Eve                  9000            1
       B           Frank               10000            1
North  A           Alice                7000            2
       B           Bob                  6000            1
South  A           Alice                7000            1
       B           Dave                16000            2

In [24]:
df.groupby(['region', 'subdivision', 'player_name']).agg(
    total_salary=('salary', 'sum'),
    appearances=('player_name', 'count')
).reset_index()

  region subdivision player_name  total_salary  appearances
0   East           A         Eve          9000            1
1   East           B       Frank         10000            1
2  North           A       Alice          7000            2
3  North           B         Bob          6000            1
4  South           A       Alice          7000            1
5  South           B        Dave         16000            2

In [31]:
#Filter option

df[df['player_name'] == 'Alice']

  region subdivision player_name  salary
0  North           A       Alice    5000
2  South           A       Alice    7000
7  North           A       Alice    2000

In [32]:
df[df['player_name'].isin(['Alice', 'Bob'])]

  region subdivision player_name  salary
0  North           A       Alice    5000
1  North           B         Bob    6000
2  South           A       Alice    7000
7  North           A       Alice    2000

In [34]:
df[df['player_name'].str.lower()=='alice']

  region subdivision player_name  salary
0  North           A       Alice    5000
2  South           A       Alice    7000
7  North           A       Alice    2000

In [35]:
df[(df['player_name'] == 'Alice') & (df['region'] == 'North')]

  region subdivision player_name  salary
0  North           A       Alice    5000
7  North           A       Alice    2000

In [36]:
df['player_name'].dropna()

0    Alice
1      Bob
2    Alice
3     Dave
4     Dave
5      Eve
6    Frank
7    Alice
Name: player_name, dtype: object

In [48]:
df.dtypes

region         object
subdivision    object
player_name    object
salary          int64
dtype: object

In [55]:
df[['player_name','region']].dtypes

player_name    object
region         object
dtype: object

In [57]:
df['salary'].dtype

dtype('int64')

In [58]:
df['player_name'] = df['player_name'].str.lower()
df

  region subdivision player_name  salary
0  North           A       alice    5000
1  North           B         bob    6000
2  South           A       alice    7000
3  South           B        dave    8000
4  South           B        dave    8000
5   East           A         eve    9000
6   East           B       frank   10000
7  North           A       alice    2000

In [59]:
df.groupby('player_name').size()

player_name
alice    3
bob      1
dave     2
eve      1
frank    1
dtype: int64

In [60]:
import pandas as pd

# Employees DataFrame
employees = pd.DataFrame({
    'emp_id': [1, 2, 3, 4],
    'name': ['Alice', 'Bob', 'Charlie', 'David'],
    'dept_id': [101, 102, 103, 104]
})

# Departments DataFrame
departments = pd.DataFrame({
    'dept_id': [101, 102, 103, 105],
    'dept_name': ['HR', 'Engineering', 'Marketing', 'Finance']
})

In [61]:
inner_join = pd.merge(employees, departments, on='dept_id', how='inner')
print(inner_join)

   emp_id     name  dept_id    dept_name
0       1    Alice      101           HR
1       2      Bob      102  Engineering
2       3  Charlie      103    Marketing

. Concatenation (Stacking DataFrames)

In [ ]:
# Vertically stack DataFrames with same columns
combined = pd.concat([df1, df2], axis=0)

# Horizontally combine DataFrames with same index
combined = pd.concat([df1, df2], axis=1)

In [62]:
import pandas as pd

# Sample DataFrame
df = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Charlie', 'Diana'],
    'Gender': ['Female', 'Male', 'Male', 'Female']
})

# Swap Male and Female
df['Gender'] = df['Gender'].replace({'Male': 'Female', 'Female': 'Male'})

In [ ]:
df['Gender'] = df['Gender'].apply(lambda x: 'Female' if x == 'Male' else 'Male')

: